{"title": "Contact Tracer, COVID-19 Contact Tracing Program", "company_name": "Applied Memetics LLC", "location": "None", "job_description": "Overview:\nAM has immediate openings for Contact Tracers to support state and local efforts to fight the COVID-19 Contact Tracing program, nationwide. High call-volume position. No travel required. This position will begin immediately.\n\nBackground: The scale and complexity of the COVID-19 outbreak has underscored the need for prompt and effective implementation of evidence-based containment measures. Contact tracing is one of the interventions that has been used to effectively control recent pandemics (Ebola, SARS), and has shown to be effective against COVID-19 mitigation in South Korea, New Zealand and elsewhere.\n\nAM LLC has identified over 18,000 qualified and motivated candidates who have responded to our call to action to support COVID-19 response efforts. Our candidates are located throughout the U.S., come from a variety of backgrounds, and possess the skills and personal qualities necessary to work as Contact Tracers, Care Resource Coordinators, and Case Investigators.\n\nThe successful Contact Tracer will work remotely to conduct a virtual “needs check,” and connect at-risk COVID-19 positive patients and people in quarantine to community resources.\nResponsibilities:\nCall contacts of newly-diagnosed patients\nCommunicate with contacts in a professional and empathetic manner\nCollect and record information on symptoms into the CRM\nProvide contacts with approved information on state/local quarantine procedures, and, if appropriate, refer them to testing according to protocol (and/or to a COVID-19 Care Resource Coordinator for social resources.)\nContact Tracers will follow the script to inform contacts about the importance of quarantine, and what to do if symptoms develop. They are not permitted to deviate from the script, or provide information that is not included in the script.\nContact tracers will be required to use their own telephone, computer and electronic equipment\nMaintain daily contact with the supervisor\nQualifications:\nGeneral Requirements\n“Making Contact: A Training for COVID-19 Contact Tracers” (ASTHO) completed by date of hire.\nAbility to exhibit a professional, positive attitude and work ethic\nExcellent interpersonal skills; ability to interact professionally with culturally diverse individuals during a time of crisis and distress\nAbility to show empathy to distressed individuals\nCollege degree or equivalent required\nExcellent organizational and communication skills\nAbility to speak, read, and write English\nSecond or multiple languages a plus (especially Spanish, Portuguese, French, Haitian-Creole, Mandarin, Cantonese, Bengali)\nCritical thinking and sound judgment required\nAbility to handle confidential information with discretion and professionalism\nTechnology requirements: PC with Windows 10, Antivirus Protection: Windows Defender and Windows Firewall; or Mac with Apple OS X 10.13, Antivirus Protection: Sophos; and personal mobile device to use for this job. (A headset is preferred.)\nNote: Due to the high volume of applicants, we may be unable to respond to telephone or email inquiries, but we are reviewing and considering all applications in the order in which they were submitted on a rolling basis.", "empId": "applied_memetics_llc_contact_tracer,_covid-19_contact_tracing_program"}