{"title": "Software Engineer I (SE I)", "company_name": "Neustar", "location": "Bengaluru", "job_description": "Neustar is an information services and technology company and a leader in identity resolution providing the data and technology that enables trusted connections between companies and people at the moments that matter most. More information is available at https://www.home.neustar.\n\nJob Requisition:R-2830 Software Engineer I (SE I) (Open)Primary Location:BANGALOREJob Description:\n\nNeustar, Inc. (NYSE: NSR) is a trusted, neutral provider of real-time information and analytics to the communications services, financial services, retail, educational, and media and advertising sectors. Neustar applies its advanced, secure technologies to help its clients promote and protect their businesses. More information is available at www.neustar.biz.\n\nThe Data and Analytics organization at Neustar is the DNA of the company. The DNA encodes the essence of existence and character that drives continuous innovation with data, continuous insights with analytics and continuous evolution with cutting-edge data products and services. Our vision is to be the trailblazer in Connection Science driven information services that create meaningful value for our customers. Our mission is to enable cutting-edge data products & services delivered through superior data, unique insights and top-of-the-class technology solutions.\n\nKey Responsibilities Include:\n\n• Ensure defect free product releases Negotiate and understand detailed functional requirements with the product team.\n\n• Design and document software components that meet organization standards\n\n• Code high quality software components in accordance with organizational standards, technical requirements, and detailed designs.\n\n• Work in an agile scrum team as part of a small development team.\n\n• Effectively participate in a team oriented environment that involves continuous design reviews, code reviews, and collaboration.\n\n• Proactively communicate with Development Management and/or regarding the status and potential impacts on the delivery date and/or expected quality of tasks and projects.\n\n• Actively work with Project Management and QA teams and produce technical documentation required by QA.\n\n• Follow established development processes for assigned projects. This position will be responsible for planning, deploying, supporting, maintaining and troubleshooting applications, services and solutions in support of Neustar’s Data Solutions.\n\nSkills and Experience:\n\n• 2 - 4 years of experience developing complex, reliable software systems based on Java.\n\n• Experience working in an agile development process/environment.\n\n• Expertise in Python/Dajano, JAVA (5.0 or above) and OO Methodology.\n\nExpert level experience in JavaScript, jQuery, HTML5, CSS3\n\n• Experience with AngularJS (version 2 preferred), Smartclient.\n\n• Experience with Tomcat, Spring, preferably having Spring MVC experience.\n\n• Experience with Maven, Ant, Git and/or similar build tools.\n\n• Experience with Web Services, WSDL, SSL certificate management. Experience in building secure software and awareness of best security practices like OWASP top 10 is a plus.\n\n• Expertise with Relational Databases and NoSQL databases.\n\n• Experience with building and deploying applications using virtualization solutions like VMWare, Oracle VM.\n\n• Experience with deployment and configuration management tools (eg: Chef, Puppet, Ansible) is a plus\n\n• Experience working on and developing software for Linux/Unix/Solaris platforms.\n\n• Experience with designing and developing enterprise class web-based applications with stringent availability, performance and SLA requirements.\n\n• Good communication skills and the ability to work well within a team\n\n• Strong verbal and written communication skills; Ability to communicate ideas in both technical and user-friendly language.\n\n• Highly self-motivated and directed, with keen attention to detail.\n\n• Able to prioritize and execute tasks in a high-pressure environment.\n\nWhy work with us?\n\nBecause you love to build beautiful, innovative solutions that wow the customerBecause you believe in changing the status quo and are up for the challenge of your lifeBecause you know you can make a difference to people, places and things!\n\nAbout Us\n\nEvery day, the world generates roughly 2.5 quadrillion bits of data. Neustar isolates certain elements and analyzes, simplifies and edits them to make precise and valuable decisions that drive results. As one of the few companies capable of knowing with certainty who is on the other end of every interaction, we’re trusted by the world’s great brands to make critical decisions some 20 billion times a day.\n\nDIVERSITY\n\nDiversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us.\n\nEOE of Minorities/Females/Vets/Disability\n\nNeustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws.\n\nNeustar does not accept unsolicited resumes from external firms or agencies. Neustar will not be responsible for placement fees associated with unsolicited resumes.\n\nDIVERSITY\n\nDiversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us.\n\nEOE of Minorities/Females/Vets/Disability\n\nNeustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws.", "empId": "e05e9e62cac55005a52084b58f6649d4"}