{"title": "Sr Systems Admin", "company_name": "Neustar", "location": "Bengaluru", "job_description": "Neustar, Inc. is a leading global information services provider driving the connected world forward with trusted, holistic identity resolution. More information is available at https://www.home.neustar.\n\nJob Requisition:R-1847 Sr Systems Admin (Open)Primary Location:BANGALOREJob Description:\n\nLevel 3 Apps:\n\nResponsible for planning, deploying, supporting, maintaining and troubleshooting applications, services and solutions within Neustar's Order Management System (OMS) Systems Administration and Application Support team\n\nPlan, install, administer and troubleshoot applications, systems and services in production, lab/test, and development environments.\n\nAdminister and support high availability mission critical applications and systems.\n\nAnalyze and resolve complex problems including interoperability issues, issues caused by hardware or software.\n\nDevelop and implement processes and procedures for Automated Deployments and Continuous Integration.\n\nPartner with internal teams and take initiative to implement and improve organizational processes and procedures.\n\nLead integration of applications and services with network management tools.\n\nCreate and maintain documentation as it relates to system configuration, mapping, processes, and operational support.\n\nTechnical Skills:\n\n3 to 5 years’ experience with Java/J2EE, Hibernate, Spring/JSF/ Angular JS.\n\n3 to 5 years’ experience with BPEL , Tomcat and Apache server.\n\n3 to 5 years’ experience with automation tools such as chef and Jenkins.\n\n5 plus years’ experience with Database driven applications ORACLE/MySQL.\n\nVery good knowledge on Linux production application environment.\n\nExperience with source code control GIT application\n\nNeustar does not accept unsolicited resumes from external firms or agencies. Neustar will not be responsible for placement fees associated with unsolicited resumes.\n\nDIVERSITY\n\nDiversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us.\n\nEOE of Minorities/Females/Vets/Disability\n\nNeustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws.", "empId": "neustar_sr_systems_admin"}