{"title": "Software Engineer II - FullStack", "company_name": "Neustar", "location": "Bengaluru", "job_description": "Neustar, Inc. is a leading global information services provider driving the connected world forward with trusted, holistic identity resolution. More information is available at https://www.home.neustar.\n\nJob Requisition:R-1687 Software Engineer II - FullStack (Open)Primary Location:BANGALOREJob Description:\n\nThe Data and Analytics organization at Neustar is the DNA of the company. The DNA encodes the essence of existence and character that drives continuous innovation with data, continuous insights with analytics and continuous evolution with cutting-edge data products and services. Our vision is to be the trailblazer in Connection Science driven information services that create meaningful value for our customers. Our mission is to enable cutting-edge data products & services delivered through superior data, unique insights and top-of-the-class technology solutions. We believe in developing a Collaborative, Creative, yet Competitive, Customer Centric culture. We are shaping the present and the future at Neustar and are seeking “TENXERS” who share the same DNA.\n\nJob Description:\n\nThe Senior Engineer of DNA – Spark is a data and technical leader responsible to design and develop the next generation of data processing on Hadoop/ Spark platform. The technical leader in this role will work closely with various teams including data acquisition, data products & data sciences to build the web services platform exposing these services to the end customers. The role is based out of India at the Neustar's offices in either Bangalore or Hyderabad.\n\nResponsibilities:\n\nLeading the team, designing and developing the data processing & ML code on Spark.Prototype and program data transformations and entity resolutions on petabyte-scale data on Hadoop/ Spark clusters.Understand the data patterns and design and implement the code and debug ML models for entity resolution in Spark. Work on Spark code performance improvement.Run along the cutting edge with an all-star lineup of experts in computer science, software engineering, marketing science, operation research and marketing strategy.\n\nSkills and Experience:\n\nBachelors degree in computer science or engineering discipline (master degree preferred)6-9 years of experience in information technology and information services domain4+ years of experience in the data, analytics and sciences domain with significant hands on experienceAdept at data architecture, data platforms and ecosystem tools, technologies and applications. Experience with the latest data and digital ecosystem related to marketing, advertising, security, internet of things and related domains is a plusAdept in the use of big data, business intelligence and analytics with significant past deliveries and achievements using SQL, Map-Reduce, Spark and other distributed computing frameworks including cloud (AWS, Azure etc.)Adept at data pre-processing, complex data transformations using ETL/ELT technologies and SQL as well as NOSQL technologies, relational as well as graph databases and data API frameworks to query data off these databasesGood hands-on programing skills in Java, Python and Scala.Fast executor with a track record of delivering complex projects on time; responds under pressures of time and uncertaintyHands on experience with continuous integration and continuous deployment tools including Chef, Jenkins etc.Strong written, editing, proofreading and oral communicationStrong inter-personal communication and collaboration skills\n\nNice to have:\n\nExperience in implementing entity resolution models in Spark/ experience in digital marketing, advertising domains is a plusExperience in using Spark graph libraries will be a definite advantage\n\nNeustar does not accept unsolicited resumes from external firms or agencies. Neustar will not be responsible for placement fees associated with unsolicited resumes.\n\nDIVERSITY\n\nDiversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us.\n\nEOE of Minorities/Females/Vets/Disability\n\nNeustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws.", "empId": "neustar_software_engineer_ii_-_fullstack"}