{"title": "Software Engineer I (SE I UI)", "company_name": "Neustar", "location": "Bengaluru", "job_description": "Neustar is an information services and technology company and a leader in identity resolution providing the data and technology that enables trusted connections between companies and people at the moments that matter most. More information is available at https://www.home.neustar.\n\nJob Requisition:R-2772 Software Engineer I (SE I UI) (Open)Primary Location:BANGALOREJob Description:\n\nNeustar, Inc. As a global information services provider and leader in Connection Science, we know how to connect people, places, and things. Our marketing, risk, security, registry, and communications solutions help over 12,000 clients grow and guard their businesses. More information is available at https://www.home.neustar.\n\nJob Requisition:\n\nApplication Developer / Back end Developer\n\nPrimary Location:\n\nBangalore\n\nJob Description:\n\nIn this role you will be working for a diverse team that is responsible for the entire workflow of maximizing revenue from ad spending. Right from data ingestion to massaging the data to fit the needs of modeling algorithms, the modeling algorithms themselves, you will be actively involved in maintenance and development of the product. You will have an opportunity to work with diverse technologies like Python, Spark or numpy, Groovy, Matlab/R in cloud environment.\n\nResponsibilities:\n\n• You will be responsible for understanding new functional requirements, wireframes, mockups and convert them into web app with emphasis on performance and Scale.\n\n• You will be responsible for developing reusable UI component and contributing high quality, production ready code.\n\n• You will be responsible for converting UI design into High quality HTML&CSS codes, writing the design documents, unit testing cases.\n\n• You will be responsible for interacting with TPMs and eliciting design requirements.\n\n• You will be responsible for front end app ownership and resolving technical issues in a timely manner.\n\nQualifications\n\n• Bachelor’s/Master’s degree in Engineering with 3+ years experience.\n\n• Strong knowledge in HTML5, CSS, SASS/Bootstrap, OOP JavaScript, JQuery & AJAX are preferred.\n\n• Strong knowledge in developing responsive web app, designing models (JSON) and (Server communication (REST APIs) are preferred.\n\n• Strong knowledge in modern Frontend frameworks & libraries like Angular, Redux + React are preferred.\n\n• Strong Knowledge in HTML templates and modern templating technologies are preferred.\n\n• Strong knowledge in modern libraries like React is preferred.\n\n• Knowledge of NodeJS, NPM packages is a huge plus.\n\n• Knowledge of Gulp, Bower is a plus.\n\n• Knowledge of ExpressJS is desirable.\n\n• Knowledge of Docker is desirable.\n\n• Basic Knowledge of relational DBMS and SQL\n\n• Stellar academic is extremely desirable.\n\nAbout Us\n\nEvery day, the world generates roughly 2.5 quadrillion bits of data. Neustar isolates certain elements and analyzes, simplifies and edits them to make precise and valuable decisions that drive results. As one of the few companies capable of knowing with certainty who is on the other end of every interaction, we’re trusted by the world’s great brands to make critical decisions some 20 billion times a day. We help marketers send timely and relevant messages to the right people. Because we can authoritatively tell a client exactly who is calling or connecting with them, we make critical real-time responses possible. And the same comprehensive information that enables our clients to direct and manage orders also stops attackers. We know when someone isn’t who they claim to be, which helps stop fraud and denial of service before they’re a problem. Because we’re also an experienced manager of some of the world’s most complex databases, we help clients control their online identity, registering and protecting their domain name, and routing traffic to the correct network address. By linking the most essential information with the people who depend on it, we provide more than 12,000 clients worldwide with decisions—not just data. More information is available at https://www.home.neustar.\n\nDiversity\n\nDiversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us.\n\nNeustar does not accept unsolicited resumes from external firms or agencies. Neustar will not be responsible for placement fees associated with unsolicited resumes.\n\nDIVERSITY\n\nDiversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us.\n\nEOE of Minorities/Females/Vets/Disability\n\nNeustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws.", "empId": "neustar_software_engineer_i_(se_i_ui)"}